import './HeroBlock.css'

type HeroBlockProps = {
  allSubscribed: boolean
}

const IconCross = () => (
  <svg width="62" height="62" viewBox="0 0 62 62" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path d="M58.4168 51.2375C60.3953 53.2188 60.3954 56.4312 58.4168 58.4125C56.4382 60.3938 53.2301 60.3937 51.2515 58.4125L3.66536 10.7625C1.68669 8.78118 1.68669 5.56882 3.66536 3.5875C5.64402 1.60618 8.85207 1.60618 10.8307 3.5875L58.4168 51.2375Z" fill="#F7F7F7"/>
    <path d="M10.7492 58.4123C8.7705 60.3935 5.56241 60.3936 3.5838 58.4123C1.60519 56.431 1.6053 53.2186 3.5838 51.2373L51.1699 3.5873C53.1486 1.60598 56.3566 1.60598 58.3353 3.5873C60.3139 5.56863 60.3139 8.78098 58.3353 10.7623L10.7492 58.4123Z" fill="#F7F7F7"/>
  </svg>
)

const IconCheck = () => (
  <svg width="80" height="62" viewBox="0 0 80 62" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path d="M70.5078 1.87907C72.4617 -0.391782 75.8753 -0.639127 78.1324 1.32671C80.3894 3.29263 80.6352 6.7272 78.6814 8.99809L34.6936 60.1208C33.732 61.2385 32.3591 61.9144 30.8919 61.9924C29.4246 62.0704 27.9883 61.5436 26.9149 60.534L1.7142 36.8315C-0.466658 34.7804 -0.582034 31.3395 1.4566 29.1453C3.4952 26.9511 6.91512 26.8351 9.09599 28.8861L30.1951 48.7295L70.5078 1.87907Z" fill="#F7F7F7"/>
  </svg>
)

export const HeroBlock = ({ allSubscribed }: HeroBlockProps) => (
  <div className="hero-block">
    {allSubscribed ? <IconCheck /> : <IconCross />}
    <p className="hero-block__text">
      {allSubscribed
        ? 'Вы подписаны на все необходимые каналы'
        : 'Вы подписаны не на все каналы'}
    </p>
  </div>
)
